nc: 7  # Pedestrian, Rider, Car, Truck, Bus, Rare, Device
names: ['pedestrian', 'rider', 'car', 'truck', 'bus', 'rare_vehicle', 'traffic_device']

depth_multiple: 0.33
width_multiple: 0.50

loss:
  box: EIoULoss
  box_weight: 5.0
  cls_weight: 0.5
  dfl_weight: 1.5

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                 
  - [-1, 1, Conv, [128, 3, 2]]              
  - [-1, 3, C2f, [128, True]]                 
  - [-1, 1, Conv, [256, 3, 2]]               
  - [-1, 6, GAMSBlock, [256, 1, [3,5,7], True]] 
  - [-1, 1, Conv, [512, 3, 2]]                
  - [-1, 6, C2f, [512, True]]                
  - [-1, 1, Conv, [1024, 3, 2]]              
  - [-1, 3, C2f, [1024, True]]                 
  - [-1, 1, SPPF, [1024, 5]]                 

head:
  - [-1, 1, DPSConv, [512, 1, 1]]             
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]                 
  - [-1, 3, C2f, [512, False]]                

  - [-1, 1, DPSConv, [256, 1, 1]]             
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] 
  - [[-1, 4], 1, Concat, [1]]                 
  - [-1, 3, GPDA, [256, 1, False]]            

  - [-1, 1, DPSConv, [256, 3, 2]]             
  - [[-1, 13], 1, Concat, [1]]                
  - [-1, 3, GPDA, [512, 1, False]]           

  - [-1, 1, DPSConv, [512, 3, 2]]            
  - [[-1, 9], 1, Concat, [1]]                
  - [-1, 1, C2f, [1024, False]]              

  - [[17, 20, 23], 1, Detect, [nc]]           
